In [2]:
!pip install pandas

Collecting pandas
  Downloading https://files.pythonhosted.org/packages/57/2f/504c4d568178b97f67bd5056a2c26b6d422ab2e5dd142a1d290ac0e3f58b/pandas-1.0.3-cp37-cp37m-win32.whl (7.5MB)
Requirement already satisfied: python-dateutil>=2.6.1 in c:\users\big data\pycharmprojects\eb102_python\venv\lib\site-packages (from pandas) (2.8.1)
Collecting numpy>=1.13.3 (from pandas)
  Downloading https://files.pythonhosted.org/packages/ff/d3/b6f9aa7506b0220a0677870cdbcd1b1f0ad7af24d20f4f96cee411c9446c/numpy-1.18.4-cp37-cp37m-win32.whl (10.8MB)
Collecting pytz>=2017.2 (from pandas)
  Downloading https://files.pythonhosted.org/packages/4f/a4/879454d49688e2fad93e59d7d4efda580b783c745fd2ec2a3adf87b0808d/pytz-2020.1-py2.py3-none-any.whl (510kB)
Requirement already satisfied: six>=1.5 in c:\users\big data\pycharmprojects\eb102_python\venv\lib\site-packages (from python-dateutil>=2.6.1->pandas) (1.14.0)
Installing collected packages: numpy, pytz, pandas
Successfully installed numpy-1.18.4 pandas-1.0.3 pytz-2020.1

In [3]:
'''
Pandas 的基本操作
'''
import pandas as pd

# 宣告一個 Data Frame 並設定欄位
df = pd.DataFrame(columns = ['a', 'b', 'c'])
df

Empty DataFrame
Columns: [a, b, c]
Index: []

In [7]:
# 插入一個 row
df.loc[0] = [1, 2, 3]
df.loc[1] = [2, 3, 4]
df.loc[3] = [3, 5, 6]
df.loc['C'] = [5, 6, 5]
df

   a  b  c
0  1  2  3
1  2  3  4
3  3  5  6
C  5  6  5

In [8]:
df['d'] = [2, 2, 3, 4]
df

   a  b  c  d
0  1  2  3  2
1  2  3  4  2
3  3  5  6  3
C  5  6  5  4

In [10]:
# 資料並沒有真正被刪除
df.drop(['d'], axis=1)

   a  b  c
0  1  2  3
1  2  3  4
3  3  5  6
C  5  6  5

In [11]:
df

   a  b  c  d
0  1  2  3  2
1  2  3  4  2
3  3  5  6  3
C  5  6  5  4

In [12]:
# 須將新的 DataFrame 存回 df 才是真的將欄位刪除
df = df.drop(['d'], axis=1)
df

   a  b  c
0  1  2  3
1  2  3  4
3  3  5  6
C  5  6  5

In [13]:
df = df.drop(['C'])

In [14]:
df

   a  b  c
0  1  2  3
1  2  3  4
3  3  5  6

In [15]:
df['b'][3] = 100
df

   a    b  c
0  1    2  3
1  2    3  4
3  3  100  6

In [16]:
# 修改整 row
df.loc[0] = 200
df

     a    b    c
0  200  200  200
1    2    3    4
3    3  100    6

In [23]:
df.to_csv(r'./test_pandas.csv', index=0, encoding='utf-8')

In [25]:
df2 = pd.read_csv(r'./test_pandas.csv')

In [26]:
df2

     a    b    c
0  200  200  200
1    2    3    4
2    3  100    6